In [3]:
## assignment3
import pandas as pd

In [10]:
company_salary=[{'year':1990,'name':'Alice','department':'HR','age':25,'salary':50000},
                {'year':1990,'name':'Bob','department':'RD','age':30,'salary':48000},
                {'year':1990,'name':'Charlie','department':'Admin','age':45,'salary':55000},
                {'year':1991,'name':'Alice','department':'HR','age':26,'salary':55000},
                {'year':1991,'name':'Bob','department':'RD','age':31,'salary':52000},
                {'year':1991,'name':'Charlie','department':'Admin','age':46,'salary':50000},
                {'year':1992,'name':'Alice','department':'HR','age':27,'salary':60000},
                {'year':1992,'name':'Bob','department':'RD','age':32,'salary':52000},
                {'year':1992,'name':'Charlie','department':'Admin','age':47,'salary':62000}]
table= pd.DataFrame(company_salary, index = [0,1,2,3,4,5,6,7,8])
table

   age department     name  salary  year
0   25         HR    Alice   50000  1990
1   30         RD      Bob   48000  1990
2   45      Admin  Charlie   55000  1990
3   26         HR    Alice   55000  1991
4   31         RD      Bob   52000  1991
5   46      Admin  Charlie   50000  1991
6   27         HR    Alice   60000  1992
7   32         RD      Bob   52000  1992
8   47      Admin  Charlie   62000  1992

In [14]:
table.groupby(['year'])['salary'].sum()

year
1990    153000
1991    157000
1992    174000
Name: salary, dtype: int64

In [12]:
table.groupby(['name'])['salary'].sum()

name
Alice      165000
Bob        152000
Charlie    167000
Name: salary, dtype: int64

In [13]:
table.groupby(['year', 'department'])['salary'].sum()

year  department
1990  Admin         55000
      HR            50000
      RD            48000
1991  Admin         50000
      HR            55000
      RD            52000
1992  Admin         62000
      HR            60000
      RD            52000
Name: salary, dtype: int64